In [5]:
import pandas as pd
import numpy as np

In [6]:
ratings = pd.read_csv('C:/Users/Admin/Downloads/ml-100k/u.data', sep="\t", names=["user_id", "item_id", "rating", "timestamp"])
movies = pd.read_csv('C:/Users/Admin/Downloads/ml-100k/u.item', sep="|", encoding="latin-1", names=[
    "item_id", "title", "release_date", "video_release_date", "IMDb_URL",
    "unknown", "Action", "Adventure", "Animation", "Children's", "Comedy", "Crime",
    "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery",
    "Romance", "Sci-Fi", "Thriller", "War", "Western"
])
users = pd.read_csv('C:/Users/Admin/Downloads/ml-100k/u.user', sep="|", names=["user_id", "age", "gender", "occupation", "zip_code"])

In [7]:
ratings.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [8]:
movies[["item_id", "title"]].head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [9]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [10]:
ratings = ratings.merge(movies[["item_id", "title"]], on="item_id")
data = ratings.merge(users, on="user_id")

In [ ]:
data.to_csv('C:/Users/Admin/Downloads/ml-100k/merged_data.csv', index=False)